//  Напишите программу, которая выводит третью цифру числа или
// сообщает, что третьей цифры нет.
Console.WriteLine("Ввeдите число");
int n = int.Parse(Console.ReadLine()!);

void Div(int arg)
{
    if(arg < 100)
        Console.WriteLine("Третьей цифры нет.");

    
    else if(arg => 100) 
       int result = arg % 1000 / 100;
       Console.WriteLine(result);

        
     
}


Div(n);


//void Div (int a)
//{
  //  if(a = new Random().Next(0, 100));
    //{
    //Console.WriteLine("Третьей цифры нет.");  
    //}             

    //else
    //{
    //result = int a % 1000 / 100;
    //Console.WriteLine(result);
   // }
        
            
//}

//Div(N);


